{
  "layers_config": {
    "class_name": "Sequential",
    "config": {
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 32, 32, 3]
          }
        },
        {
          "class_name": "Rescaling",
          "config": {
            "scale": 0.00784313725490196,
            "offset": -1
          }
        },
        {
          "class_name": "Flatten"
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 14,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 14,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "leaky_relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "linear"
          }
        }
      ]
    }
  },
  "weight_b64": 